# Terminal and Shell enhancements
brew "zsh"
brew "bash"
brew "tmux"
brew "neovim"
brew "starship"
brew "chezmoi"
brew "thefuck"

# File navigation and search
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "tree"
brew "htop"
brew "jq"
brew "tldr"
brew "coreutils"

# System tools
brew "coreutils"
brew "neofetch"
brew "wget"
brew "curl"
brew "openssh"
brew "screen"
brew "grep"

# Development tools
brew "git"
brew "git-delta"
brew "rbenv"
brew "nodenv"
brew "pyenv"
brew "goenv"

# macOS-specific utilities
brew "mas"

# Applications
cask "alt-tab"
cask "gas-mask"
cask "raycast"
cask "iterm2"
cask "visual-studio-code"
cask "notion"
cask "postman"
cask "slack"
cask "arc"
cask "docker"
cask "rectangle"
cask "hiddenbar"

# Virtualization
cask "utm"

# Fonts
cask "font-fira-code-nerd-font"
cask "scroll-reverser"
